CreateDC.Accident.Certain.Incident.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header />
    <SOAP-ENV:Body>
        <CreateIncidentRequest
            NS1:schemaLocation="http://uicds.org/IncidentManagementService services\IncidentManagement\0.1\IncidentManagementService.xsd"
            xmlns="http://uicds.org/IncidentManagementService" xmlns:NS1="http://www.w3.org/2001/XMLSchema-instance">
            <inc:Incident xmlns:inc="http://uicds.org/incident">
                <ActivityCategoryText xmlns="http://niem.gov/niem/niem-core/2.0">HazMat</ActivityCategoryText>
                <ActivityDate xmlns="http://niem.gov/niem/niem-core/2.0">
                    <DateTime>2009-11-20T12:05:00</DateTime>
                </ActivityDate>
                <ActivityDescriptionText xmlns="http://niem.gov/niem/niem-core/2.0">Washington Nationals Baseball
                    Game
                </ActivityDescriptionText>
                <ActivityName xmlns="http://niem.gov/niem/niem-core/2.0">Bomb Threat (Demo)</ActivityName>
                <IncidentLocation xmlns="http://niem.gov/niem/niem-core/2.0">
                    <LocationAddress>
                        <AddressFullText>Nationals Stadium</AddressFullText>
                    </LocationAddress>
                    <LocationArea>
                        <AreaCircularRegion>
                            <CircularRegionCenterCoordinate>
                                <GeographicCoordinateLatitude>
                                    <LatitudeDegreeValue>38</LatitudeDegreeValue>
                                    <LatitudeMinuteValue>52</LatitudeMinuteValue>
                                    <LatitudeSecondValue>22.62</LatitudeSecondValue>
                                </GeographicCoordinateLatitude>
                                <GeographicCoordinateLongitude>
                                    <LongitudeDegreeValue>-77</LongitudeDegreeValue>
                                    <LongitudeMinuteValue>00</LongitudeMinuteValue>
                                    <LongitudeSecondValue>26.94</LongitudeSecondValue>
                                </GeographicCoordinateLongitude>
                            </CircularRegionCenterCoordinate>
                            <CircularRegionRadiusLengthMeasure>
                                <MeasurePointValue>4.5</MeasurePointValue>
                                <LengthUnitCode>SMI</LengthUnitCode>
                            </CircularRegionRadiusLengthMeasure>
                        </AreaCircularRegion>
                    </LocationArea>
                </IncidentLocation>
                <IncidentJurisdictionalOrganization xmlns="http://niem.gov/niem/niem-core/2.0">
                    <OrganizationName>Metropolitan Police</OrganizationName>
                    <OrganizationPrincipalOfficial>
                        <PersonName>
                            <PersonFullName>Lt. Jones</PersonFullName>
                        </PersonName>
                    </OrganizationPrincipalOfficial>
                    <OrganizationStatus>
                        <StatusDescriptionText>Activated</StatusDescriptionText>
                    </OrganizationStatus>
                </IncidentJurisdictionalOrganization>
                <inc:ExtendedMetadata xmlns:inc="http://uicds.org/IncidentManagementService"
                    codespace="urn:oasis:names:tc:emergency:cap:1.2" code="Certainty" label="Certainty">Certain</inc:ExtendedMetadata>
            </inc:Incident>
        </CreateIncidentRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
