com/spotonresponse/SOAPnewIncidentRequest.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
	<CreateIncidentRequest NS1:schemaLocation="http://uicds.org/IncidentManagementService services\IncidentManagement\0.1\IncidentManagementService.xsd" xmlns="http://uicds.org/IncidentManagementService" xmlns:NS1="http://www.w3.org/2001/XMLSchema-instance">
		<inc:Incident xmlns:inc="http://uicds.org/incident">
			<ActivityCategoryText xmlns="http://niem.gov/niem/niem-core/2.0">Event</ActivityCategoryText>
			<ActivityDate xmlns="http://niem.gov/niem/niem-core/2.0">
				<DateTime>{DATETIME}</DateTime>
			</ActivityDate>
			<ActivityDescriptionText xmlns="http://niem.gov/niem/niem-core/2.0">{DESCRIPTION}</ActivityDescriptionText>
			<ActivityName xmlns="http://niem.gov/niem/niem-core/2.0">{ACTIVITY}</ActivityName>
			<IncidentLocation xmlns="http://niem.gov/niem/niem-core/2.0">
				<LocationAddress>
					<AddressFullText>{ADDRESS}</AddressFullText>
				</LocationAddress>
				<LocationArea>
					<AreaCircularRegion>
						<CircularRegionCenterCoordinate>
							<GeographicCoordinateLatitude>
								<LatitudeDegreeValue>{LATDEG}</LatitudeDegreeValue>
								<LatitudeMinuteValue>{LATMIN}</LatitudeMinuteValue>
								<LatitudeSecondValue>{LATSEC}</LatitudeSecondValue>
							</GeographicCoordinateLatitude>
							<GeographicCoordinateLongitude>
								<LongitudeDegreeValue>{LONDEG}</LongitudeDegreeValue>
								<LongitudeMinuteValue>{LONMIN}</LongitudeMinuteValue>
								<LongitudeSecondValue>{LONSEC}</LongitudeSecondValue>
							</GeographicCoordinateLongitude>
						</CircularRegionCenterCoordinate>
						<CircularRegionRadiusLengthMeasure>
							<MeasurePointValue>{RADIUS}</MeasurePointValue>
							<LengthUnitCode>SMI</LengthUnitCode>
						</CircularRegionRadiusLengthMeasure>
					</AreaCircularRegion>
				</LocationArea>
			</IncidentLocation>
			<IncidentJurisdictionalOrganization xmlns="http://niem.gov/niem/niem-core/2.0">
				<OrganizationName>{ORGANIZATION}</OrganizationName>
				<OrganizationPrincipalOfficial>
				</OrganizationPrincipalOfficial>
				<OrganizationStatus>
					<StatusDescriptionText>Activated</StatusDescriptionText>
				</OrganizationStatus>
			</IncidentJurisdictionalOrganization>
		</inc:Incident>
	</CreateIncidentRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
